#include <stdio.h>
#include <stdlib.h>

//Функция за намиране на най
//голямото число

//-----------------------------------
int findMax(int arr[], int n) {
    int max = arr[0];
    for (int i = 1; i < n; i++) {
        if (arr[i] > max) {
            max = arr[i];
        };
    }
    return max;
}

//Функция за принтиране на масива
//в различни моенти от време

//-------------------------------------
void printArray(int arr[], int n) {
    printf("|");
    for (int i = 0; i < n; i++) {
        printf("%d ", arr[i]);
    }
    printf("\n");
}
//-------------------------------------

//Функция която имплементирая countingSort с
//негативни числа включително

//----------------------------------------------
void countingSort(int arr[], int n, int exp) {
    int output[n];
    //count е с декларирана дължина
    //19 защото това ще са позициите от 
    //{-9...0...9} => 19
    int i, count[19] = {0};

    //В първия цикъл се итерира през
    //всяко едно число за да се определи
    //позицията му 
    for (i = 0; i < n; i++) {
        //Тук се добавя 9 за да може
        // ако числото е отрицателно
        //например -4, като му се добави 
        //9 така да му се определи позицията
        //в count масива => -4+9=5 = >
        //на 4-та позиция(масива започва от 0 ел.)
        count[(arr[i] / exp) % 10 + 9]++;
    }

    //В този масив ще се обхожда
    //count масива с 19-те му
    //позиции
    for (i = 1; i < 19; i++) {
        //тук актуализираме count
        //масива като добавяма 
        //дадения елемент с предишния
        //за да се гарантира
        //че масива пази крайните позиции
        //на всяко число
        count[i] += count[i - 1];
    }

    //Този цикъл започва да обхожда
    //масива отзад на пред
    for (i = n - 1; i >= 0; i--) {
        //тук е малко сложно обяснението
        //но е еквивалентно на това във
        //втория цикъл
        output[count[(arr[i] / exp) % 10 + 9] - 1] = arr[i];
        count[(arr[i] / exp) % 10 + 9]--;
    }

    //Този цикъл обхожда началния масив
    //като има за цел да премести 
    //подредените елементм от
    //временния масив в началния
    for (i = 0; i < n; i++) {
        arr[i] = output[i];
    }
}
//----------------------------------------------

//Функцията на Radix Sort-a

//----------------------------------------------------------------------------------------------------------
void radixsort(int arr[], int n, int exp) {
    int max = findMax(arr, n);

    countingSort(arr, n, exp);

    //Функцията се извиква рекърсивно
    //докато най-големият елемент
    //разделен на експонанта не
    //даде 0
    if (max / exp != 0) {
        printf("\n-------------------------------------------------------------------------------------");
        printf("\n|Radix Sort with exp (единици, десетици, хилядни и тн.) = %d: \n", exp);
        printArray(arr, n);
        printf("-------------------------------------------------------------------------------------\n");
        //рекурсивно извикване на 
        //функцията като всеки път 
        //увеличаваме експонанта
        //(1, 10, 100 - единици, десетици
        //хилядни и тн.)
        radixsort(arr, n, exp * 10);
    }
}
//----------------------------------------------------------------------------------------------------------

//Main функцията

//----------------------------------------------------------------------------------------------------------
int main() {
    int arr[] = {170, -45, 75, -90, 802, -24, 2, 66, 778, 1, 2, 7, -2, -10, -23, -90, -100, -802};
    int n = sizeof(arr) / sizeof(arr[0]);

    printf("\nRADIX SORT WITH MOST SIGNIFICANT DIGIT\n");

    printf("\nUnsorted array ");
    printArray(arr, n);
    radixsort(arr, n, 1);

    printf("\nSorted array ");
    printArray(arr, n);

    //Обяснение относно сложността на алгоритъма
    printf("\nTIME COMPLEXITY: O(d * (n + b)) ");
    printf("\n d - Максималния брой от цифри в едно число в масива");
    printf("\n n - Броя на елементите в масива");
    printf("\n b - Основа за номерационната ситема");

    return 0;
}
//----------------------------------------------------------------------------------------------------------